---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Room.ClosedShell
zh: 房间
source: html/1a510aef-63f6-4d32-c0ff-a8071f5e23b8.htm
---
# Autodesk.Revit.DB.Architecture.Room.ClosedShell Property

**中文**: 房间

Return the closedShell of the Room.

## Syntax (C#)
```csharp
public GeometryElement ClosedShell { get; }
```